
public class B01_If {

	/*
		# if¹®
		- ()¾È¿¡ °ªÀÌ ture ÀÏ¶§ {}¾ÈÀÇ ³»¿ëÀ» ½ÇÇàÇÑ´Ù
		- ()¾È¿¡ °ªÀÌ false ÀÏ¶§ {}¾ÈÀÇ ³»¿ëÀ» ¹«½ÃÇÑ´Ù 
		- {}¾È¿¡¼­ ½ÇÇàÇÒ ³»¿ëÀÌ ´Ü ÇÑ ÁÙÀÌ¶ó¸é {}¸¦ »ý·«ÇÒ ¼ö ÀÖ´Ù (ÀÏºÎ·¯ ÇÏÁö ¾Ê´Â °æ¿ì°¡ ¸¹À½)
		
		# else if ¹®
		- À§¿¡ ÀÖ´Â if ¹®ÀÌ ½ÇÇàµÇÁö ¾Ê¾Ò´Ù¸é ¹Ø¿¡¼­ if¹®Ã³·³ µ¿ÀÛÇÑ´Ù
		- else if´Â ´Üµ¶À¸·Î »ç¿ëµÉ ¼ö ¾ø´Ù
		- else if´Â ¿©·¯¹ø »ç¿ëÇÒ ¼ö ÀÖ´Ù
		
		# else ¹®
		- À§¿¡ ÀÖ´Â ¸ðµç if ¹®°ú else if ¹®ÀÌ ¸ðµÎ ½ÇÇàµÇÁö ¾Ê¾Ò´Ù¸é {}¾ÈÀÇ ³»¿ëÀ» ¹«Á¶°Ç ½ÇÇàÇÑ´Ù
		- if ¹® ¹Ù·Î ´ÙÀ½¿¡ »ç¿ëÇÒ ¼öµµ ÀÖ´Ù
	*/
	public static void main(String[]args) {
		
		char ch = '-';
				
		
		if (ch >='°¡' && ch <= 'ÆR') {
			System.out.println("ch¿¡ µé¾îÀÖ´Â °ªÀº ÇÑ±ÛÀÔ´Ï´Ù!");	
			System.out.println("if¹® ³¡!");
		} else if (ch >='a' && ch <='z') {
			System.out.println("Ch¿¡ µé¾î ÀÖ´Â °ªÀº ¾ËÆÄºª ¼Ò¹®ÀÚÀÔ´Ï´Ù!");
		} else if (ch >='A' && ch <='Z') {
				System.out.println("Ch¿¡ µé¾î ÀÖ´Â °ªÀº ¾ËÆÄºª ´ë¹®ÀÚÀÔ´Ï´Ù!");
		} else { 
			System.out.println("ch¿¡ µé¾î ÀÖ´Â ¹®ÀÚ´Â ¾ËÆÄºªµµ ¾Æ´Ï°í ÇÑ±Ûµµ ¾Æ´Õ´Ï´Ù!");
		}
		System.out.println("ÇÁ·Î±×·¥ ³¡");
	}
}
